In [69]:
import pandas as pd
from sqlalchemy import create_engine
import mysql.connector as mysql

In [70]:
conn = create_engine("postgresql+pg8000://postgres:sgwi2341@localhost/penerimaan")

In [71]:
db_conn = create_engine("mysql://sugengw07:sgwi2341@localhost/mpninfo")

In [72]:
kueri2021 = '''select m."FULL" ,m."NAMA_WP" ,s."Kategori" , sum(p.jml_setor) as Nominal_2021
from penerimaan_2021 p 
full join mfwp m on (p.npwp_penyetor = m."FULL") 
full join klu k 
	on m."KODE_KLU"  = k.klu_kode 
full join sektor s 
	on k.klu_sektor = s."Kode"
where p.bulan_bayar = '1' and p.jenis_data !='RESTITUSI'
group by m."FULL" ,m."NAMA_WP",s."Kategori"
having sum(p.jml_setor) is not null 
order by Nominal_2021 desc ;'''

In [73]:
kueri2022 = '''select m."FULL" ,m."NAMA_WP" ,s."Kategori" , sum(p.nominal) as Nominal_2022
from penerimaan_2022 p 
full join mfwp m on (p."FULL"  = m."FULL") 
full join klu k 
	on m."KODE_KLU"  = k.klu_kode 
full join sektor s 
	on k.klu_sektor = s."Kode"
where p.bulanbayar ='1' and p.ket !='SPMKP'
group by m."FULL" ,m."NAMA_WP",s."Kategori"
having sum(p.nominal) is not null 
order by Nominal_2022 desc;'''

In [74]:
data_2021 = pd.read_sql(kueri2021,con=conn)

In [75]:
data_2021.head()

,FULL,NAMA_WP,Kategori,nominal_2021
0,316771872003000,MITSUBISHI MOTORS KRAMA YUDHA SALES INDONESIA,Perdagangan Besar dan Eceran; Reparasi dan Per...,1.202280e+11
1,015480486007000,FASTRATA BUANA,Perdagangan Besar dan Eceran; Reparasi dan Per...,3.432801e+10
2,019201151007000,MEDIKALOKA HERMINA Tbk,Jasa Kesehatan dan Kegiatan Sosial,2.746910e+10
3,010027134007000,SOHO INDUSTRI PHARMASI,Industri Pengolahan,2.565536e+10
4,017350976007000,ROYAL SUTAN AGUNG,Perdagangan Besar dan Eceran; Reparasi dan Per...,2.199339e+10

In [76]:
data_2022 = pd.read_sql(kueri2022,con=conn)

In [77]:
data_2022.head()

,FULL,NAMA_WP,Kategori,nominal_2022
0,316771872003000,MITSUBISHI MOTORS KRAMA YUDHA SALES INDONESIA,Perdagangan Besar dan Eceran; Reparasi dan Per...,6.617229e+10
1,017350976007000,ROYAL SUTAN AGUNG,Perdagangan Besar dan Eceran; Reparasi dan Per...,2.918902e+10
2,020532339043000,DWIJALLA KARSA,Perdagangan Besar dan Eceran; Reparasi dan Per...,1.959216e+10
3,017107095007000,TRITUNGGAL INTIPERMATA,Jasa Keuangan dan Asuransi,1.690786e+10
4,023882145073000,UNITED EQUIPMENT INDONESIA,Perdagangan Besar dan Eceran; Reparasi dan Per...,1.689091e+10

In [78]:
data = pd.merge(data_2021,data_2022,on=['FULL', 'NAMA_WP', 'Kategori'],how='outer')

In [80]:
data = data.groupby(['FULL', 'NAMA_WP', 'Kategori']).sum().reset_index()

In [81]:
data

,FULL,NAMA_WP,Kategori,nominal_2021,nominal_2022
0,010007516007000,INDRIA,Real Estat,1.729521e+08,2.381579e+08
1,010008068007000,KRAMA YUDHA RATU MOTOR,Industri Pengolahan,3.104791e+09,9.781609e+09
2,010010726002000,INTI UTAMA DHARMA REAL ESTATE,Real Estat,2.054256e+07,1.838927e+08
3,010010726008001,INTI UTAMA DHARMA REAL ESTATE,Real Estat,2.512196e+07,2.163580e+07
4,010017044059000,KADI INTERNATIONAL,Konstruksi,4.178340e+08,5.159684e+07
...,...,...,...,...,...
1033,931950018005000,INDO LOG ONE,Real Estat,9.029145e+08,1.140466e+09
1034,933405144006000,LOTTE LAND MODERN REALTY,Real Estat,5.678972e+07,1.352815e+08
1035,935178129003000,WAHANA BUAH SEGAR,Perdagangan Besar dan Eceran; Reparasi dan Per...,1.133077e+07,1.268269e+08
1036,943912725008000,KOTRACK MACHINERY INDONESIA,Perdagangan Besar dan Eceran; Reparasi dan Per...,6.019330e+08,1.218895e+09
1037,947423075008000,TIGA IKHWAN MEDIKAL,Perdagangan Besar dan Eceran; Reparasi dan Per...,2.530608e+07,2.720000e+06

In [82]:
data.to_excel(r'D:\DATA KANTOR\VSCODE\2022\2022_persektor_growth.xlsx',index=False)